#+TITLE: Coverage By Release
#+PROPERTY: header-args:sql-mode :product postgres :noweb yes

** Output as Json
  The rows are already set up for us with no additional manipulation needed, I do believe
  #+begin_src sql-mode
    select json_agg(cp) as output_json
      from (
        select * from stable_conformance_coverage_per_release
      )cp;
  #+end_src

  #+RESULTS:
  #+begin_SRC example
                                                              output_json
  ------------------------------------------------------------------------------------------------------------------------------------
   [{"release":"1.5.0","new endpoints":200,"tested":81,"untested":119,"total tested":81,"total untested":119,"total endpoints":200}, +
    {"release":"1.6.0","new endpoints":7,"tested":5,"untested":2,"total tested":86,"total untested":121,"total endpoints":207},      +
    {"release":"1.7.0","new endpoints":18,"tested":3,"untested":15,"total tested":89,"total untested":136,"total endpoints":225},    +
    {"release":"1.8.0","new endpoints":39,"tested":9,"untested":30,"total tested":98,"total untested":166,"total endpoints":264},    +
    {"release":"1.9.0","new endpoints":63,"tested":24,"untested":39,"total tested":122,"total untested":205,"total endpoints":327},  +
    {"release":"1.10.0","new endpoints":9,"tested":4,"untested":5,"total tested":126,"total untested":210,"total endpoints":336},    +
    {"release":"1.11.0","new endpoints":2,"tested":0,"untested":2,"total tested":126,"total untested":212,"total endpoints":338},    +
    {"release":"1.12.0","new endpoints":1,"tested":0,"untested":1,"total tested":126,"total untested":213,"total endpoints":339},    +
    {"release":"1.13.0","new endpoints":0,"tested":0,"untested":0,"total tested":126,"total untested":213,"total endpoints":339},    +
    {"release":"1.14.0","new endpoints":18,"tested":11,"untested":7,"total tested":137,"total untested":220,"total endpoints":357},  +
    {"release":"1.15.0","new endpoints":0,"tested":0,"untested":0,"total tested":137,"total untested":220,"total endpoints":357},    +
    {"release":"1.16.0","new endpoints":28,"tested":26,"untested":2,"total tested":163,"total untested":222,"total endpoints":385},  +
    {"release":"1.17.0","new endpoints":1,"tested":0,"untested":1,"total tested":163,"total untested":223,"total endpoints":386},    +
    {"release":"1.18.0","new endpoints":0,"tested":0,"untested":0,"total tested":163,"total untested":223,"total endpoints":386},    +
    {"release":"1.19.0","new endpoints":32,"tested":31,"untested":1,"total tested":194,"total untested":224,"total endpoints":418}]
  (1 row)

  #+end_SRC

  Yep!  so now we run a psql query that strips the headers and outputs it to our resources/coverage/conformance-coverage-per-release.json
  #+begin_src sql-mode
    begin;
    \t
    \a
    \o  ../resources/coverage/conformance-coverage-per-release.json

      select json_agg(cp) as output_json
      from (
        select * from stable_conformance_coverage_per_release
      )cp;

    \o
    \a
    \t
    commit;

  #+end_src

  #+RESULTS:
  #+begin_SRC example
  BEGIN
  Tuples only is on.
  Output format is unaligned.
  #+end_SRC

which we can test with jq
#+begin_src shell
  cat ../resources/coverage/conformance-coverage-per-release.json | jq .
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "release": "1.5.0",
    "new endpoints": 200,
    "tested": 81,
    "untested": 119,
    "total tested": 81,
    "total untested": 119,
    "total endpoints": 200
  },
  {
    "release": "1.6.0",
    "new endpoints": 7,
    "tested": 5,
    "untested": 2,
    "total tested": 86,
    "total untested": 121,
    "total endpoints": 207
  },
  {
    "release": "1.7.0",
    "new endpoints": 18,
    "tested": 3,
    "untested": 15,
    "total tested": 89,
    "total untested": 136,
    "total endpoints": 225
  },
  {
    "release": "1.8.0",
    "new endpoints": 39,
    "tested": 9,
    "untested": 30,
    "total tested": 98,
    "total untested": 166,
    "total endpoints": 264
  },
  {
    "release": "1.9.0",
    "new endpoints": 63,
    "tested": 24,
    "untested": 39,
    "total tested": 122,
    "total untested": 205,
    "total endpoints": 327
  },
  {
    "release": "1.10.0",
    "new endpoints": 9,
    "tested": 4,
    "untested": 5,
    "total tested": 126,
    "total untested": 210,
    "total endpoints": 336
  },
  {
    "release": "1.11.0",
    "new endpoints": 2,
    "tested": 0,
    "untested": 2,
    "total tested": 126,
    "total untested": 212,
    "total endpoints": 338
  },
  {
    "release": "1.12.0",
    "new endpoints": 1,
    "tested": 0,
    "untested": 1,
    "total tested": 126,
    "total untested": 213,
    "total endpoints": 339
  },
  {
    "release": "1.13.0",
    "new endpoints": 0,
    "tested": 0,
    "untested": 0,
    "total tested": 126,
    "total untested": 213,
    "total endpoints": 339
  },
  {
    "release": "1.14.0",
    "new endpoints": 18,
    "tested": 11,
    "untested": 7,
    "total tested": 137,
    "total untested": 220,
    "total endpoints": 357
  },
  {
    "release": "1.15.0",
    "new endpoints": 0,
    "tested": 0,
    "untested": 0,
    "total tested": 137,
    "total untested": 220,
    "total endpoints": 357
  },
  {
    "release": "1.16.0",
    "new endpoints": 28,
    "tested": 26,
    "untested": 2,
    "total tested": 163,
    "total untested": 222,
    "total endpoints": 385
  },
  {
    "release": "1.17.0",
    "new endpoints": 1,
    "tested": 0,
    "untested": 1,
    "total tested": 163,
    "total untested": 223,
    "total endpoints": 386
  },
  {
    "release": "1.18.0",
    "new endpoints": 0,
    "tested": 0,
    "untested": 0,
    "total tested": 163,
    "total untested": 223,
    "total endpoints": 386
  },
  {
    "release": "1.19.0",
    "new endpoints": 32,
    "tested": 31,
    "untested": 1,
    "total tested": 194,
    "total untested": 224,
    "total endpoints": 418
  }
]
#+end_example

love it!
